[
  {
    "id": 12,
    "brand": "Rivian",
    "name": "R1T",
    "image": "https://example.com/images/r1t.jpg",
    "description": "The Rivian R1T is an all-electric pickup truck that combines rugged capability with sustainable performance. With its bold and distinctive design, the R1T stands out on and off the road. Its electric drivetrain delivers impressive torque and off-road prowess, making it a true adventure companion. The R1T offers a spacious and versatile interior, with innovative storage solutions and advanced technology. With its long electric range and fast-charging capabilities, the Rivian R1T redefines what a pickup truck can be, providing both power and sustainability in one impressive package.",
    "price": "$67,500",
    "model": "R1T",
    "vehicle_type": "Pickup Truck",
    "release_year": 2021,
    "maximum_power": 754
  },
  {
    "id": 13,
    "brand": "Kia",
    "name": "EV6",
    "image": "https://example.com/images/ev6.jpg",
    "description": "The Kia EV6 is a stylish and futuristic all-electric crossover that offers a blend of performance, technology, and sustainability. With its sleek and aerodynamic design, the EV6 stands out on the road and provides a spacious and comfortable interior. Its electric powertrain delivers exhilarating acceleration and a long electric range, making it suitable for both daily commutes and weekend getaways. The EV6 features advanced technology, including a high-resolution infotainment system and a suite of driver-assistance features. Kia's commitment to electric mobility is evident in the EV6, a vehicle that sets a new standard for eco-friendly driving.",
    "price": "$45,000",
    "model": "EV6",
    "vehicle_type": "Crossover",
    "release_year": 2022,
    "maximum_power": 576
  },
  {
    "id": 14,
    "brand": "Volvo",
    "name": "XC40 Recharge",
    "image": "https://example.com/images/xc40_recharge.jpg",
    "description": "The Volvo XC40 Recharge is an all-electric compact SUV that combines Scandinavian design, advanced safety features, and sustainable performance. With its modern and distinctive styling, the XC40 Recharge exudes confidence on the road. Its electric powertrain provides instant acceleration and a long electric range, ensuring you can go the distance. The XC40 Recharge features a thoughtfully designed interior with premium materials and intuitive technology. Volvo's commitment to safety is evident in the extensive list of driver-assistance features that come standard. Embrace electric driving with the Volvo XC40 Recharge, a vehicle that blends luxury and sustainability.",
    "price": "$53,990",
    "model": "XC40 Recharge",
    "vehicle_type": "SUV",
    "release_year": 2020,
    "maximum_power": 402
  },
  {
    "id": 15,
    "brand": "Polestar",
    "name": "2",
    "image": "https://example.com/images/polestar_2.jpg",
    "description": "The Polestar 2 is a premium all-electric fastback that combines Scandinavian design, performance, and sustainability. With its sleek and minimalist exterior, the Polestar 2 makes a bold statement on the road. Its electric powertrain delivers instant acceleration and a long electric range, providing a thrilling and eco-friendly driving experience. The Polestar 2 features a high-quality interior with sustainable materials and advanced technology, including a large infotainment display and voice control. As a brand committed to sustainability, Polestar brings together luxury and electric mobility in the Polestar 2.",
    "price": "$59,900",
    "model": "2",
    "vehicle_type": "Fastback",
    "release_year": 2020,
    "maximum_power": 408
  },
  {
    "id": 16,
    "brand": "Rimac",
    "name": "Nevera",
    "image": "https://example.com/images/nevera.jpg",
    "description": "The Rimac Nevera is an all-electric hypercar that pushes the boundaries of performance and technology. With its striking design and aerodynamic shape, the Nevera stands out as a true automotive masterpiece. Its electric powertrain delivers mind-blowing acceleration and a top speed that rivals the fastest cars in the world. The Nevera features cutting-edge technology, including advanced driver-assistance systems and a sophisticated infotainment system. As one of the most powerful production cars ever made, the Rimac Nevera represents the pinnacle of electric performance and serves as a testament to the future of automotive engineering.",
    "price": "$2,400,000",
    "model": "Nevera",
    "vehicle_type": "Hypercar",
    "release_year": 2021,
    "maximum_power": 1914
  },
  {
    "id": 17,
    "brand": "Lucid",
    "name": "Air",
    "image": "https://example.com/images/lucid_air.jpg",
    "description": "The Lucid Air is a luxury all-electric sedan that redefines the standards of electric mobility. With its sleek and aerodynamic design, the Air combines elegance and performance. Its electric powertrain delivers exceptional acceleration and a long electric range, making it a compelling choice for those seeking both luxury and sustainability. The Air features a spacious and luxurious interior, with advanced technology and high-quality materials. From its innovative DreamDrive driver-assistance system to its immersive rear-seat experience, the Lucid Air offers a truly refined and forward-thinking driving experience.",
    "price": "$69,900",
    "model": "Air",
    "vehicle_type": "Sedan",
    "release_year": 2021,
    "maximum_power": 1080
  },
  {
    "id": 18,
    "brand": "Toyota",
    "name": "Mirai",
    "image": "https://example.com/images/mirai.jpg",
    "description": "The Toyota Mirai is a hydrogen fuel cell electric vehicle (FCEV) that offers a sustainable and zero-emission alternative to traditional internal combustion engines. With its futuristic design and advanced technology, the Mirai represents Toyota's commitment to a hydrogen-powered future. The Mirai's fuel cell system generates electricity through a chemical reaction between hydrogen and oxygen, producing only water vapor as a byproduct. This innovative technology provides long-range capabilities and quick refueling times, offering a convenient and eco-friendly driving experience. Experience the future of hydrogen mobility with the Toyota Mirai.",
    "price": "$58,500",
    "model": "Mirai",
    "vehicle_type": "Sedan",
    "release_year": 2014,
    "maximum_power": 182
  },
  {
    "id": 19,
    "brand": "Mini",
    "name": "Cooper SE",
    "image": "https://example.com/images/cooper_se.jpg",
    "description": "The Mini Cooper SE is a compact all-electric hatchback that combines iconic style with sustainable driving. With its retro-inspired design and compact size, the Cooper SE is perfect for urban environments. Its electric motor delivers quick acceleration and responsive handling, making it a fun and agile car to drive. The Cooper SE offers a modest electric range, suitable for daily commutes and city driving. Inside the cabin, you'll find a charming and modern interior with Mini's signature design elements. Embrace electric mobility with the Mini Cooper SE and enjoy an eco-friendly driving experience with style.",
    "price": "$29,900",
    "model": "Cooper SE",
    "vehicle_type": "Hatchback",
    "release_year": 2020,
    "maximum_power": 181
  },
  {
    "id": 20,
    "brand": "NIO",
    "name": "ES8",
    "image": "https://example.com/images/es8.jpg",
    "description": "The NIO ES8 is a premium all-electric SUV that offers luxury, performance, and advanced technology. With its sleek and muscular design, the ES8 exudes confidence and presence on the road. Its electric drivetrain provides powerful acceleration and a long electric range, making it suitable for both city driving and long journeys. The ES8 features a spacious and elegant interior, with high-quality materials and cutting-edge technology. NIO's commitment to innovation is evident in features like its interchangeable battery system and advanced driver-assistance systems. Experience the future of luxury SUVs with the NIO ES8.",
    "price": "$67,783",
    "model": "ES8",
    "vehicle_type": "SUV",
    "release_year": 2017,
    "maximum_power": 653
  },
  {
    "id": 21,
    "brand": "Chevrolet",
    "name": "Bolt EV",
    "image": "https://example.com/images/bolt_ev.jpg",
    "description": "The Chevrolet Bolt EV is a practical and affordable all-electric hatchback that offers a compelling option for everyday driving. With its compact size and efficient design, the Bolt EV is perfect for navigating urban environments. Its electric powertrain delivers zippy acceleration and a respectable electric range, ensuring you can handle your daily commutes with ease. The Bolt EV features a spacious interior with user-friendly technology and ample cargo space. Chevrolet's commitment to electric mobility is evident in the Bolt EV, a vehicle that provides practicality and efficiency in a stylish package.",
    "price": "$31,995",
    "model": "Bolt EV",
    "vehicle_type": "Hatchback",
    "release_year": 2017,
    "maximum_power": 200
  },
  {
    "id": 22,
    "brand": "Tesla",
    "name": "Model S",
    "image": "https://example.com/images/model_s.jpg",
    "description": "The Tesla Model S is a groundbreaking all-electric sedan that revolutionized the automotive industry. With its sleek and futuristic design, the Model S combines luxury, performance, and sustainability. Its electric drivetrain provides blistering acceleration and a long electric range, setting new standards for electric vehicles. The Model S features a minimalist and high-tech interior, with a large touchscreen display and advanced autopilot capabilities. Tesla's Supercharger network enables convenient long-distance travel, making the Model S a compelling choice for electric mobility. Experience the future of transportation with the Tesla Model S.",
    "price": "$79,990",
    "model": "Model S",
    "vehicle_type": "Sedan",
    "release_year": 2012,
    "maximum_power": 1020
  },
  {
    "id": 23,
    "brand": "Nissan",
    "name": "Leaf",
    "image": "https://example.com/images/leaf.jpg",
    "description": "The Nissan Leaf is a popular and affordable all-electric hatchback that has been at the forefront of electric mobility for over a decade. With its practical design and efficient performance, the Leaf offers an accessible option for eco-conscious drivers. Its electric motor provides smooth and quiet acceleration, making it a comfortable car for daily commuting. The Leaf offers a respectable electric range and comes with features like Nissan's ProPILOT Assist for added convenience and safety. Nissan's commitment to electric mobility is evident in the Leaf, a vehicle that has helped shape the future of electric cars.",
    "price": "$31,620",
    "model": "Leaf",
    "vehicle_type": "Hatchback",
    "release_year": 2010,
    "maximum_power": 214
  },
  {
    "id": 24,
    "brand": "Audi",
    "name": "e-tron GT",
    "image": "https://example.com/images/e-tron_gt.jpg",
    "description": "The Audi e-tron GT is a premium all-electric grand tourer that combines performance, luxury, and sustainability. With its stunning design and aerodynamic shape, the e-tron GT turns heads wherever it goes. Its electric drivetrain delivers exhilarating acceleration and a long electric range, making it a versatile car for both daily driving and long journeys. The e-tron GT features a sophisticated and luxurious interior, with high-quality materials and advanced technology. Audi's attention to detail and craftsmanship is evident in every aspect of the e-tron GT, creating a truly captivating and eco-friendly driving experience.",
    "price": "$99,900",
    "model": "e-tron GT",
    "vehicle_type": "Grand Tourer",
    "release_year": 2021,
    "maximum_power": 637
  },
  {
    "id": 25,
    "brand": "Hyundai",
    "name": "Kona Electric",
    "image": "https://example.com/images/kona_electric.jpg",
    "description": "The Hyundai Kona Electric is a versatile and affordable all-electric SUV that offers practicality and efficiency. With its compact size and stylish design, the Kona Electric is perfect for urban adventures. Its electric motor provides responsive acceleration and a decent electric range, making it suitable for daily commuting. The Kona Electric features a well-designed interior with user-friendly technology and a comfortable cabin. Hyundai's commitment to electric mobility is evident in the Kona Electric, a vehicle that combines affordability and sustainability in a compelling package.",
    "price": "$37,390",
    "model": "Kona Electric",
    "vehicle_type": "SUV",
    "release_year": 2018,
    "maximum_power": 201
  }
]
